Repository: aitoribanez/angular-build-in-i18n
Catalog: src/i18n/messages.*.xlf
Languages: es, eu

source: Hello world!
es: Hola mundo!
eu: Kaixo mundua!

# introductionHello
source: Hello user,
es: Hola usuario,
eu: Kaixo erabiltzaile,

# pluralWolves
source: {VAR_PLURAL, plural, =0 {no wolves} =1 {one wolf} =2 {two wolves} other {a wolf pack} }
es: {VAR_PLURAL, plural, =0 {no lobos} =1 {1 lobo} =2 {2 lobos} other {{{this.wolves}} lobos} }
eu: {VAR_PLURAL, plural, =0 {otsorik ez} =1 {otso bat} =2 {bi otso} other {otso ugari} }

# needsHome
source: Home
es: Casa
eu: Etxea

# needsOrchard
source: Orchard
es: Huerta
eu: Baratza

# hasPerson
source: Person
es: Persona
eu: Pertsona

# translatedText
source: My amazing text!
es: Mi apasionante texto!
eu: Nire textu zoragarria!

# translatedComment&quot;: optional meaning|optional description
source: Comment text
es: Texto del comentario
eu: Iruzkinaren textua

# translatedImgTitle
source: Colmena logo
es: Logo de Colmena
eu: Colmena-ren logoa

# translatedGender
source: The hero is {ICU}
es: El heroe es {ICU}
eu: Heroea {ICU}

source: {VAR_SELECT, select, m {male} f {female} }
es: {VAR_SELECT, select, m {hombre} f {mujer} }
eu: {VAR_SELECT, select, m {emakumea da} f {gizona da} }

# pluralGender
source: Here we have: {ICU}
es: Aqui tenemos: {ICU}
eu: Hemen daukagu: {ICU}

source: {VAR_PLURAL, plural, =0 {no one} =1 {one {VAR_SELECT, select, male {man} female {woman} }} other {{INTERPOLATION} {VAR_SELECT_1, select, male {men} female {women} }} }
es: {VAR_PLURAL, plural, =0 {ninguno} =1 {un {VAR_SELECT, select, m {hombre} f {mujer} }} other {{INTERPOLATION} {VAR_SELECT_1, select, m {hombres} f {mujeres} }} }
eu: {VAR_PLURAL, plural, =0 {bat ere ez} =1 {{VAR_SELECT, select, m {emakume} f {gizon} } bat} other {{INTERPOLATION} {VAR_SELECT_1, select, m {emakume} f {gizon} }} }
